01  WS-AREA. 
    05  WS-AMOUNT PIC 9(5) VALUE 0. 
    05  WS-COUNTER PIC 9(3) VALUE 0. 

    PROCEDURE DIVISION. 
    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 5 
       ADD 10 TO WS-AMOUNT 
       END-PERFORM. 
    DISPLAY "Final Amount: " WS-AMOUNT. 
    STOP RUN.